In [5]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [4]:
temp_db

Engine(sqlite:///:memory:)

In [7]:
df = pd.DataFrame(data = np.random.randint(low = 0, high = 100, size = (4,4)), columns = ['a', 'b', 'c', 'd'])

In [8]:
df

    a   b   c   d
0  61  10  34  84
1  27  94  71  20
2  75  73  89   3
3  20  58  22  94

In [ ]:
df.to_sql(name = 'new_table', con = temp_db)

4

In [10]:
new_df = pd.read_sql(sql= 'new_table', con= temp_db)

In [11]:
new_df

   index   a   b   c   d
0      0  61  10  34  84
1      1  27  94  71  20
2      2  75  73  89   3
3      3  20  58  22  94

In [14]:
result = pd.read_sql_query(sql = "SELECT a, c FROM new_table", con = temp_db)

In [15]:
result

    a   c
0  61  34
1  27  71
2  75  89
3  20  22

In [ ]:
re